# DATA FRAMING

In [33]:
import pandas as pd

In [34]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year' : [2000,2001,2002,2003,2004,2005],
         'pop' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]                }
df1 = pd.DataFrame(data)
df1




# pandas onvert this data in frame.

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2003  2.4
4  Nevada  2004  2.9
5  Nevada  2005  3.2

In [35]:
frame = pd.DataFrame (data, columns=['Year', 'State', 'Pop'])          #no index
frame

Empty DataFrame
Columns: [Year, State, Pop]
Index: []

In [36]:
frame = pd.DataFrame (data, columns=['Year', 'State', 'Pop'], index=[11,22,33,44,55,66])          #index provided
frame

   Year State  Pop
11  NaN   NaN  NaN
22  NaN   NaN  NaN
33  NaN   NaN  NaN
44  NaN   NaN  NaN
55  NaN   NaN  NaN
66  NaN   NaN  NaN

In [37]:
frame = pd.DataFrame (data, columns=['Year', 'State', 'Pop', 'Debt'], index = ['one', 'two', 'three', 'four'])
                      #new column >extra< provided but no value given
frame                 #hence NaN will be the value assigned. i.e no value.

      Year State  Pop Debt
one    NaN   NaN  NaN  NaN
two    NaN   NaN  NaN  NaN
three  NaN   NaN  NaN  NaN
four   NaN   NaN  NaN  NaN

In [38]:
frame.columns                                                 #columns name shown.

Index(['Year', 'State', 'Pop', 'Debt'], dtype='object')

In [39]:
frame.index                                                   #index names shown.

Index(['one', 'two', 'three', 'four'], dtype='object')

In [40]:
#  if there is a space in the name of a data, say the name was frame_1 , .index/.columns cannot work.

In [41]:
val = pd.Series([-1.2,-1.5,-1.7], index=['one','four','five'])

In [42]:
val

one    -1.2
four   -1.5
five   -1.7
dtype: float64

In [43]:
frame.Debt=val
frame

      Year State  Pop  Debt
one    NaN   NaN  NaN  -1.2
two    NaN   NaN  NaN   NaN
three  NaN   NaN  NaN   NaN
four   NaN   NaN  NaN  -1.5

In [44]:
pop = {'Nevada': {2001:2.4,2002:2.9},                 # a disctionary having key and value = dictionary
       'Ohio':{2000:1.5, 2001:1.7, 2002:3.6}}          #Dictionary within dictionary.
frame3 = pd.DataFrame(pop)

In [45]:
frame3                    #no value given for year 2000 to Nevada hence NaN

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [46]:
pd.DataFrame(pop, index= [2001, 2002, 2003])                      #index changed.

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [47]:
pdata = {'Ohio': frame3['Ohio'][:-1],
          'Nevada': frame3 ['Nevada'][:2]            }
pdata

{'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64, 'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64}

In [48]:
pdata = pd. DataFrame(pdata)                          #dictionary made a frame.
pdata

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [49]:
frame3.index.name = 'year'; frame3.columns.name = 'sate'
frame

      Year State  Pop  Debt
one    NaN   NaN  NaN  -1.2
two    NaN   NaN  NaN   NaN
three  NaN   NaN  NaN   NaN
four   NaN   NaN  NaN  -1.5

# Essential Functionality
Reindexing

In [50]:
obj = pd.Series([4.5, 7.2,-5.3,3.6], index= ['d', 'b', 'a', 'c'])

In [51]:
#  index priorly defined are reindexed as below:

In [52]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [53]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [54]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index= [0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [55]:
obj3.reindex (range(6))       #index with values are given as it is and the new ones = NaN

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [56]:
obj3.reindex (range(6), method = 'ffill')             #if you want no NaN to be given in data . FORWARD FILL applied

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [57]:
obj3.reindex (range(6), method = 'bfill')      #BACKWARD FILL, in case of no NaN required.

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

# Reindexing on Frames

In [63]:
import numpy as np
import pandas as pd

In [70]:
import numpy as np
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
           index = ['a', 'c', 'd'],
        columns = ['Ohio', 'Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [71]:
frame2 = frame.reindex(['a', ' b', 'c', 'd'])
frame2

    Ohio  Texas  California
a    0.0    1.0         2.0
 b   NaN    NaN         NaN
c    3.0    4.0         5.0
d    6.0    7.0         8.0

In [125]:
states = ['Texas', "Utah", 'California']

frame2.reindex(columns= states)

    Texas  Utah  California
a     1.0   NaN         2.0
 b    NaN   NaN         NaN
c     4.0   NaN         5.0
d     7.0   NaN         8.0

In [126]:
frame2.reindex(index=['f','b', 'a','d','c','g'], columns =['Texas','NewYork', "Utah", 'California', 'Bay'] ) #columns&rows- reindexed.

   Texas  NewYork  Utah  California  Bay
f    NaN      NaN   NaN         NaN  NaN
b    NaN      NaN   NaN         NaN  NaN
a    1.0      NaN   NaN         2.0  NaN
d    7.0      NaN   NaN         8.0  NaN
c    4.0      NaN   NaN         5.0  NaN
g    NaN      NaN   NaN         NaN  NaN

In [127]:
data = pd.DataFrame(np.arange(1,16).reshape(3,5), columns=['a','b','c', 'd', 'e'] ) #array of 1 to 15, reshaped in 3rows&5column
data

    a   b   c   d   e
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15

In [128]:
data = pd.DataFrame(np.arange(1,101).reshape((20,5)), 
                    columns= ['a', 'b', 'c', 'd', 'e']
                     index=range(1,101,5))
data                        # range is upto 100 so this will be reshaped in 20*5=100 or 10*10=100 or 5*20=100. RHS mustbe = 100

SyntaxError: invalid syntax (<ipython-input-128-481a002205a2>, line 3)

In [129]:
data = pd.DataFrame(np.arange(1,101).reshape((20,5)), 
                    columns= list['abcde']
                    index = range(1:101:5)
data          # range is upto 100 so this will be reshaped in 20*5=100 or 10*10=100 or 5*20=100. RHS mustbe = 100

SyntaxError: invalid syntax (<ipython-input-129-aeeb1711b3ec>, line 3)

In [130]:
frame2

    Ohio  Texas  California
a    0.0    1.0         2.0
 b   NaN    NaN         NaN
c    3.0    4.0         5.0
d    6.0    7.0         8.0

In [131]:
frame2.loc['c']

Ohio          3.0
Texas         4.0
California    5.0
Name: c, dtype: float64

In [132]:
 frame2.loc[::-1]      #index reversed and a gone at the  end and d became the first.

    Ohio  Texas  California
d    6.0    7.0         8.0
c    3.0    4.0         5.0
 b   NaN    NaN         NaN
a    0.0    1.0         2.0

In [133]:
frame2.iloc[0:3]            #iloc doesn't count the lasts number hence an index of 1+ number given.

    Ohio  Texas  California
a    0.0    1.0         2.0
 b   NaN    NaN         NaN
c    3.0    4.0         5.0

In [135]:
frame2['Texas'][1]+ 5

nan

In [136]:
frame4 = frame2.copy()
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [137]:
frame2.loc["a":]

    Ohio  Texas  California
a    0.0    1.0         2.0
 b   NaN    NaN         NaN
c    3.0    4.0         5.0
d    6.0    7.0         8.0

In [138]:
frame2.loc[:]          #if nothing mentioned, all index returned

    Ohio  Texas  California
a    0.0    1.0         2.0
 b   NaN    NaN         NaN
c    3.0    4.0         5.0
d    6.0    7.0         8.0

In [139]:
frame2.loc[:'d']  #from beginning to d given

    Ohio  Texas  California
a    0.0    1.0         2.0
 b   NaN    NaN         NaN
c    3.0    4.0         5.0
d    6.0    7.0         8.0

In [140]:
frame2.loc[:'d':2]  #a returned b skipped, c returned (oz d mentioned so d won't be included)

   Ohio  Texas  California
a   0.0    1.0         2.0
c   3.0    4.0         5.0

In [141]:
 frame2.loc[::-1]     #if all'index' required to be reversed, no need to mention the last one.

    Ohio  Texas  California
d    6.0    7.0         8.0
c    3.0    4.0         5.0
 b   NaN    NaN         NaN
a    0.0    1.0         2.0

In [143]:
frame2.loc[::-1]['Texas':]  #if  'columns'  to be reversed.

KeyError: 'Texas'

In [145]:
# ABSOLUTE if any value is negative say -1, will be made +ve.But +ve values remain +ve   >> abs()
abs(-1)

1

In [146]:
#  fillna returns 0 on places of NaN.    
#  dropna >> drops i.e skips NA

In [148]:
csvData = pd.read_csv('jTeOBO.csv')
csvData.head()

,Student Code,Degree,Student Name,Mid,Quiz 1,Quiz 2,Best of Quizzes,Assignment 1,Assignment 2,Best of Assignments,Total Sessional (50),Final (50),Total (100),Grade
0,022-14-19987,BS(CS),Abdul Basit,28,8.0,3.0,8,7.0,9.0,9,45,25.0,70,B
1,022-14-110233,BS(CS),Adeel Ahmed,17,NaN,5.0,5,8.0,10.0,10,32,18.0,50,F
2,022-14-110585,BS(CS),Afrah Zareen,18,5.0,2.0,5,8.0,10.0,10,33,30.0,63,C
3,022-14-19718,BS(CS),Ahmed Ali Raza,14,7.0,2.0,7,NaN,2.0,2,23,23.0,46,F
4,022-14-110648,BS(CS),Ahsan Ali Vohra,27,7.0,6.0,7,7.0,9.0,9,43,34.0,77,B

In [149]:
df['Best of Quizzes']>7   #output = T/F

NameError: name 'df' is not defined

In [150]:
df[df['Best of Quizzes']>7]  #output won't be = T/F

NameError: name 'df' is not defined